# kosullu eleman islemleri

In [1]:
import numpy as np
import pandas as pd

In [2]:
m=np.random.randint(1,30,size=(10,3))

In [3]:
df=pd.DataFrame(m,columns=["var1","var2","var3"])

In [4]:
df

   var1  var2  var3
0    19     4     8
1    11    27    19
2     7    17    19
3    15     6    16
4    24    28    20
5    20    13     8
6    19    23    20
7    12    26    25
8     5    28    28
9     2    15    29

In [5]:
df.var1

0    19
1    11
2     7
3    15
4    24
5    20
6    19
7    12
8     5
9     2
Name: var1, dtype: int32

In [6]:
df[df.var1>15]

   var1  var2  var3
0    19     4     8
4    24    28    20
5    20    13     8
6    19    23    20

In [7]:
df[df.var1>15]["var1"]

0    19
4    24
5    20
6    19
Name: var1, dtype: int32

In [8]:
df[(df.var1>15)&(df.var2<15)]

   var1  var2  var3
0    19     4     8
5    20    13     8

In [9]:
df[df.var1>15][["var1","var2"]]

   var1  var2
0    19     4
4    24    28
5    20    13
6    19    23